Revit 2027 API
SymbolTypeId.TCO2ePerKg Property
 Symbol tCO₂e/kg, indicating tonnes Carbon Dioxide per kilogram
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TCO2ePerKg { get; }
Public Shared ReadOnly Property TCO2ePerKg As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TCO2ePerKg {
	ForgeTypeId^ get ();
}
static member TCO2ePerKg : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace